ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_Display.cpp
 /* LCD controller vertical axis plane control register lines per panel */
#define CLCDC_LCDTIMING1_LPP_WIDTH 10
#define CLCDC_LCDTIMING1_LPP(n)	_SBF(0, ((n) - 1) & _BITMASK(CLCDC_LCDTIMING1_LPP_WIDTH))
/* LCD controller vertical axis plane control register VSYNC pulse width */
#define CLCDC_LCDTIMING1_VSW_WIDTH 6
#define CLCDC_LCDTIMING1_VSW(n)	_SBF(10, ((n) - 1) & _BITMASK(CLCDC_LCDTIMING1_VSW_WIDTH))
/* LCD controller vertical axis plane control register vertical front porch */
#define CLCDC_LCDTIMING1_VFP_WIDTH 8
#define CLCDC_LCDTIMING1_VFP(n)	_SBF(16, (n) & _BITMASK(CLCDC_LCDTIMING1_VFP_WIDTH))
/* LCD controller vertical axis plane control register vertical back porch */
#define CLCDC_LCDTIMING1_VBP_WIDTH 8
#define CLCDC_LCDTIMING1_VBP(n)	_SBF(24, (n) & _BITMASK(CLCDC_LCDTIMING1_VBP_WIDTH))

/***********************************************************************
 * Color LCD controller clock and signal polarity control register definitions
 **********************************************************************/

 /* LCD controller clock and signal polarity control register panel clock divisor low*/
#define CLCDC_LCDTIMING2_PCD(n)	 CLCDC_LCDTIMING2_PCD_hi(n) | CLCDC_LCDTIMING2_PCD_lo(n)
#define CLCDC_LCDTIMING2_PCD_lo(n)	 (_SBF(0, ((n) - 2 )) & 0x0000001f)
/* LCD controller clock and signal polarity control register clock select */
#define CLCDC_LCDTIMING2_CLKSEL _BIT(5)
/* LCD controller clock and signal polarity control register AC bias pin frequency */
#define CLCDC_LCDTIMING2_ACB_WIDTH 5
#define CLCDC_LCDTIMING2_ACB(n)	_SBF(6, ((n) - 1) & _BITMASK(CLCDC_LCDTIMING2_ACB_WIDTH))
/* LCD controller clock and signal polarity control register invert VSYNC */
#define CLCDC_LCDTIMING2_IVS    _BIT(11)
/* LCD controller clock and signal polarity control register invert HSYNC */
#define CLCDC_LCDTIMING2_IHS    _BIT(12)
/* LCD controller clock and signal polarity control register invert plane clock */
#define CLCDC_LCDTIMING2_IPC    _BIT(13)
/* LCD controller clock and signal polarity control register invert output enable */
#define CLCDC_LCDTIMING2_IOE    _BIT(14)
/* LCD controller clock and signal polarity control register clocks per line */
#define CLCDC_LCDTIMING2_CPL_WIDTH 10
#define CLCDC_LCDTIMING2_CPL(n)	_SBF(16, (n) & _BITMASK(CLCDC_LCDTIMING2_CPL_WIDTH))
/* LCD controller clock and signal polarity control register bypass pixel clock divider */
#define CLCDC_LCDTIMING2_BCD 	_BIT(26)
/* LCD controller clock and signal polarity control register panel clock divisor high*/
#define CLCDC_LCDTIMING2_PCD_hi(n)	 (_SBF(22,((n) - 2 )) & 0xf8000000)

/**********************************************************************
 * Color LCD Controller line end control register definitions
 *********************************************************************/

 /* Line End Signal Delay */
#define CLCDC_LCDTIMING3_LED_WIDTH 7
#define CLCDC_LCDTIMING3_LED(n) _SBF(0, ((n) - 1) & _BITMASK(CLCDC_LCDTIMING3_LED_WIDTH))
/* Line End Enable */
#define CLCDC_LCDTIMING3_LEE    _BIT(16)

/***********************************************************************
 * Color LCD controller control register definitions
 **********************************************************************/

 /* LCD control enable bit */
#define CLCDC_LCDCTRL_ENABLE    _BIT(0)
/* LCD control 1 bit per pixel bit field */
#define CLCDC_LCDCTRL_BPP1      _SBF(1, 0)
/* LCD control 2 bits per pixel bit field */
#define CLCDC_LCDCTRL_BPP2      _SBF(1, 1)
/* LCD control 4 bits per pixel bit field */
#define CLCDC_LCDCTRL_BPP4      _SBF(1, 2)
/* LCD control 8 bits per pixel bit field */
#define CLCDC_LCDCTRL_BPP8      _SBF(1, 3)
/* LCD control 16 bits per pixel bit field */
#define CLCDC_LCDCTRL_BPP16     _SBF(1, 4)
/* LCD control 24 bits per pixel bit field */
#define CLCDC_LCDCTRL_BPP24     _SBF(1, 5)
/* LCD control 16 bits (5:6:5 mode) per pixel bit field */
#define CLCDC_LCDCTRL_BPP16_565_MODE _SBF(1, 6)
/* LCD control 12 bits (4:4:4 mode) per pixel bit field */
#define CLCDC_LCDCTRL_BPP12_444_MODE _SBF(1, 7)
/* LCD control mono select bit */
#define CLCDC_LCDCTRL_BW_COLOR  _SBF(4, 0)
#define CLCDC_LCDCTRL_BW_MONO   _SBF(4, 1)
/* LCD controler TFT select bit */
#define CLCDC_LCDCTRL_TFT       _BIT(5)
/* LCD control monochrome LCD has 4-bit/8-bit select bit */
#define CLCDC_LCDCTRL_MON8      _BIT(6)
/* LCD control dual panel select bit */
#define CLCDC_LCDCTRL_DUAL      _BIT(7)
/* LCD control RGB or BGR format select bit */
#define CLCDC_LCDCTRL_RGB       _SBF(8, 0)
#define CLCDC_LCDCTRL_BGR       _SBF(8, 1)
/* LCD control big-endian byte order select bit */
#define CLCDC_LCDCTRL_BEBO      _BIT(9)
/* LCD control big-endian pixel order within a byte select bit */
#define CLCDC_LCDCTRL_BEPO      _BIT(10)
/* LCD control power enable bit */
#define CLCDC_LCDCTRL_PWR       _BIT(11)
/* LCD control VCOMP interrupt is start of VSYNC */
#define CLCDC_LCDCTRL_VCOMP_VS  _SBF(12, 0)
/* LCD control VCOMP interrupt is start of back porch */
#define CLCDC_LCDCTRL_VCOMP_BP  _SBF(12, 1)
/* LCD control VCOMP interrupt is start of active video */
#define CLCDC_LCDCTRL_VCOMP_AV  _SBF(12, 2)
/* LCD control VCOMP interrupt is start of front porch */
#define CLCDC_LCDCTRL_VCOMP_FP  _SBF(12, 3)
/* LCD control watermark level is 8 or more words free bit */
#define CLCDC_LCDCTRL_WATERMARK _BIT(16)

/* PINSEL11 selction for TFT 16 5:6:5 */
#define TFT_16_565 0xB

//////////////////////////////////////////////////////////////////////////////
// LCD Controller
//
struct LPC24XX_LCDC {
    static const uint32_t c_LCDC_Base = 0xFFE10000;

    //    // LCD pins
    //    static const uint32_t c_LCD_PWR  = LPC24XX_GPIO::c_P2_00;
    //    static const uint32_t c_LCD_LE   = LPC24XX_GPIO::c_P2_01;
    //    static const uint32_t c_LCD_DCLK = LPC24XX_GPIO::c_P2_02;
    //    static const uint32_t c_LCD_FP   = LPC24XX_GPIO::c_P2_03;
    //    static const uint32_t c_LCD_ENAB = LPC24XX_GPIO::c_P2_04;
    //    static const uint32_t c_LCD_LP   = LPC24XX_GPIO::c_P2_05;
    //
    //    // Assignment for TFT 16 5:6:5 mode
    //    static const uint32_t c_LCD_VD_7  = LPC24XX_GPIO::c_P2_09; // Red 4
    //    static const uint32_t c_LCD_VD_6  = LPC24XX_GPIO::c_P2_08; // Red 3
    //    static const uint32_t c_LCD_VD_5  = LPC24XX_GPIO::c_P2_07; // Red 2
    //    static const uint32_t c_LCD_VD_4  = LPC24XX_GPIO::c_P2_06; // Red 1
    //    static const uint32_t c_LCD_VD_3  = LPC24XX_GPIO::c_P2_12; // Red 0
    //
    //    static const uint32_t c_LCD_VD_15 = LPC24XX_GPIO::c_P1_25; // Green 5
    //    static const uint32_t c_LCD_VD_14 = LPC24XX_GPIO::c_P1_24; // Green 4
    //    static const uint32_t c_LCD_VD_13 = LPC24XX_GPIO::c_P1_23; // Green 3
    //    static const uint32_t c_LCD_VD_12 = LPC24XX_GPIO::c_P1_22; // Green 2
    //    static const uint32_t c_LCD_VD_11 = LPC24XX_GPIO::c_P1_21; // Green 1
    //    static const uint32_t c_LCD_VD_10 = LPC24XX_GPIO::c_P1_20; // Green 0
    //
    //    static const uint32_t c_LCD_VD_23 = LPC24XX_GPIO::c_P1_29; // Blue 4
    //    static const uint32_t c_LCD_VD_22 = LPC24XX_GPIO::c_P1_28; // Blue 3
    //    static const uint32_t c_LCD_VD_21 = LPC24XX_GPIO::c_P1_27; // Blue 2
    //    static const uint32_t c_LCD_VD_20 = LPC24XX_GPIO::c_P1_26; // Blue 1
    //    static const uint32_t c_LCD_VD_19 = LPC24XX_GPIO::c_P2_13; // Blue 0

