ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_Display.cpp
    /****/ volatile uint32_t LCD_TIMH;      /* LCD horizontal axis plane control register */
    /****/ volatile uint32_t LCD_TIMV;      /* LCD vertical axis plane control register */
    /****/ volatile uint32_t LCD_POL;       /* LCD clock and signal polarity control register */
    /****/ volatile uint32_t LCD_LE;        /* LCD line end control register */
    /****/ volatile uint32_t LCD_UPBASE;    /* LCD upper plane frame base address register */
    /****/ volatile uint32_t LCD_LPBASE;    /* LCD lower plane frame base address register */
    /****/ volatile uint32_t LCD_CTRL;      /* LCD control register */
    /****/ volatile uint32_t LCD_INTMSK;    /* LCD interrupt mask set/clear register */
    /****/ volatile uint32_t LCD_INTRAW;    /* LCD raw interrupt status register */
    /****/ volatile uint32_t LCD_INTSTAT;   /* LCD masked interrupt status register */
    /****/ volatile uint32_t LCD_INTCLR;    /* LCD interrupt clear register */
    /****/ volatile uint32_t LCD_UPCURR;    /* LCD upper panel current address value register */
    /****/ volatile uint32_t LCD_LPCURR;    /* LCD lower panel current address value register */
    /****/ volatile uint32_t dummy0[115];   /* LCD reserved */
    /****/ volatile uint32_t LCD_PAL[128];  /* LCD palette registers */
    /****/ volatile uint32_t dummy1[256];   /* LCD reserved */
    /****/ volatile uint32_t CRSR_IMG[256]; /* LCD cursor image */
    /****/ volatile uint32_t CRSR_CTRL;     /* LCD cursor control register */
    /****/ volatile uint32_t CRSR_CFG;      /* LCD cursor configuration register */
    /****/ volatile uint32_t CRSR_PAL0;     /* LCD cursor palette register */
    /****/ volatile uint32_t CRSR_PAL1;     /* LCD cursor palette register */
    /****/ volatile uint32_t CRSR_XY;       /* LCD cursor xy position register */
    /****/ volatile uint32_t CRSR_CLIP;     /* LCD cursor clip position register */
    /****/ volatile uint32_t dummy2[2];     /* LCD reserved */
    /****/ volatile uint32_t CRSR_INTMSK;   /* LCD cursor interrupt mask set/clear register */
    /****/ volatile uint32_t CRSR_INTCLR;   /* LCD cursor interrupt clear register */
    /****/ volatile uint32_t CRSR_INTRAW;   /* LCD cursor raw interrupt status register */
    /****/ volatile uint32_t CRSR_INTSTAT;  /* LCD cursor masked interrupt status register */
};

// LCD Controller Driver
//
//////////////////////////////////////////////////////////////////////////////

enum LPC24xx_LCD_Rotation {
    rotateNormal_0,
    rotateCW_90,
    rotate_180,
    rotateCCW_90,
};


uint32_t m_LPC24_DisplayWidth = 0;
uint32_t m_LPC24_DisplayHeight = 0;
uint32_t m_LPC24_DisplayPixelClockRateKHz = 0;
uint32_t m_LPC24_DisplayHorizontalSyncPulseWidth = 0;
uint32_t m_LPC24_DisplayHorizontalFrontPorch = 0;
uint32_t m_LPC24_DisplayHorizontalBackPorch = 0;
uint32_t m_LPC24_DisplayVerticalSyncPulseWidth = 0;
uint32_t m_LPC24_DisplayVerticalFrontPorch = 0;
uint32_t m_LPC24_DisplayVerticalBackPorch = 0;
uint32_t m_LPC24_Display_TextRow = 0;
uint32_t m_LPC24_Display_TextColumn = 0;

bool m_LPC24_DisplayOutputEnableIsFixed = false;
bool m_LPC24_DisplayOutputEnablePolarity = false;
bool m_LPC24_DisplayPixelPolarity = false;
bool m_LPC24_DisplayHorizontalSyncPolarity = false;
bool m_LPC24_DisplayVerticalSyncPolarity = false;
bool m_LPC24_DisplayEnable = false;

uint16_t* m_LPC24_Display_VituralRam = nullptr;
size_t m_LPC24_DisplayBufferSize = 0;
uint8_t m_LPC24_Display_TextBuffer[LCD_MAX_COLUMN][LCD_MAX_ROW];

LPC24xx_LCD_Rotation m_LPC24_Display_CurrentRotation = LPC24xx_LCD_Rotation::rotateNormal_0;

bool LPC24_Display_Initialize();
bool LPC24_Display_Uninitialize();
bool LPC24_Display_SetPinConfiguration(bool enable);

void LPC24_Display_WriteFormattedChar(uint8_t c);
void LPC24_Display_WriteChar(uint8_t c, int32_t row, int32_t col);
void LPC24_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]);
void LPC24_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c);
void LPC24_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p);
void LPC24_Display_TextEnterClearMode();
void LPC24_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c);
void LPC24_Display_TextShiftColUp();
void LPC24_Display_Clear();
void LPC24_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight);

int32_t LPC24_Display_GetWidth();
int32_t LPC24_Display_GetHeight();
int32_t LPC24_Display_BitPerPixel();
uint32_t LPC24_Display_GetPixelClockDivider();
int32_t LPC24_Display_GetOrientation();
uint32_t* LPC24_Display_GetFrameBuffer();

#define TOTAL_DISPLAY_CONTROLLERS 1

static TinyCLR_Display_Controller displayControllers[TOTAL_DISPLAY_CONTROLLERS];
static TinyCLR_Api_Info displayApi[TOTAL_DISPLAY_CONTROLLERS];

#define AHBCFG1     (*(volatile unsigned *)0XE01FC188)

bool LPC24_Display_Initialize() {
    int32_t i;
    uint32_t * p32;

    uint32_t newFreq;
    uint8_t divider;

    LPC24XX_LCDC & LCDC = *(LPC24XX_LCDC *)LPC24XX_LCDC::c_LCDC_Base;

    if (m_LPC24_DisplayPixelClockRateKHz > 10)
        // change peripherals priority, LCD first
        AHBCFG1 = 0x12340144;

    /* Power Up the LCD controller. */
    LPC24XX::SYSCON().PCONP |= LPC24XX_SYSCON::ENABLE_LCD;
    LPC24_Time_Delay(nullptr, 1000 * 10);

    /* Disable the display in case it is on */
    LCDC.LCD_CTRL = 0;
    LPC24_Time_Delay(nullptr, 1000 * 10);

    LCDC.LCD_TIMH = ((m_LPC24_DisplayHorizontalBackPorch - 1) << 24) | ((m_LPC24_DisplayHorizontalFrontPorch - 1) << 16) | ((m_LPC24_DisplayHorizontalSyncPulseWidth - 1) << 8) | (((m_LPC24_DisplayWidth / 16) - 1) << 2);//(1<<24)|(16<<16)|(40<<8)|(((480/16)-1)<<2);
    LCDC.LCD_TIMV = ((m_LPC24_DisplayVerticalBackPorch) << 24) | ((m_LPC24_DisplayVerticalFrontPorch) << 16) | ((m_LPC24_DisplayVerticalSyncPulseWidth - 1) << 10) | (m_LPC24_DisplayHeight - 1);//LPC24_Display_VerticalTimingReg;//(2<<24)|(16<<16)|(9<<10)|(271);
    LCDC.LCD_POL = (1 << 26) | ((m_LPC24_DisplayWidth - 1) << 16) | (!m_LPC24_DisplayOutputEnablePolarity << 14) | (m_LPC24_DisplayPixelPolarity << 13) | (!m_LPC24_DisplayHorizontalSyncPolarity << 12) | (!m_LPC24_DisplayVerticalSyncPolarity << 11);//LPC24_Display_PolarityReg;//(1<<26)|(479<<16)|(1<<14)|(0<<13)|(1<<12)|(1<<11);
    LCDC.LCD_LE = 0;//not used

    LCDC.LCD_INTMSK = 0;

