ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_Display.cpp
    // don ot use grayscaler!!!?? manual
    LCDC.LCD_CTRL = (6 << 1) | (1 << 5) | (1 << 11) | (1 << 8)/*RGB*/ | (0 << 9)/*endian*/ | (0 << 10)/*pixel order*/;

    // clear pallete
    p32 = (uint32_t*)&LCDC.LCD_PAL;
    for (i = 0; i < 128; i++) {
        p32[i] = 0;
    }

    if (m_LPC24_DisplayPixelClockRateKHz == 0) {
        divider = 0xFF;
    }
    else {
        newFreq = (uint32_t)((LPC24_AHB_CLOCK_HZ / 1000) % m_LPC24_DisplayPixelClockRateKHz);

        if (newFreq != 0)
            divider = ((LPC24_AHB_CLOCK_HZ / 1000) / m_LPC24_DisplayPixelClockRateKHz) + 1;
        else
            divider = ((LPC24_AHB_CLOCK_HZ / 1000) / m_LPC24_DisplayPixelClockRateKHz);
    }

    LPC24XX::SYSCON().LCD_CFG = (divider - 1); //config.PixelClockDivider - 1;

    if (m_LPC24_Display_VituralRam == nullptr)
        return false;

    LCDC.LCD_UPBASE = (uint32_t)&m_LPC24_Display_VituralRam[0];

    LPC24_Time_Delay(nullptr, 1000 * 10);

    LCDC.LCD_CTRL |= 1;//enable ....also add power

    LPC24_Time_Delay(nullptr, 1000 * 10);

    LPC24_Display_TextEnterClearMode();

    return true;
}

bool LPC24_Display_Uninitialize() {
    int32_t i;

    LPC24XX_LCDC & LCDC = *(LPC24XX_LCDC *)LPC24XX_LCDC::c_LCDC_Base;

    if (m_LPC24_DisplayEnable == false)
        return true;

    // powerdown
    LCDC.LCD_CTRL &= ~1;
    LPC24_Time_Delay(nullptr, 1000 * 10);
    LCDC.LCD_CTRL = 0;
    LPC24_Time_Delay(nullptr, 1000 * 10);

    return true;
}

//====================================================
void LPC24_Display_WriteFormattedChar(uint8_t c) {
    if (m_LPC24_DisplayEnable == false)
        return;

    if (c == '\f') {
        LPC24_Display_Clear();
        LPC24_Display_TextEnterClearMode();
        m_LPC24_Display_TextColumn = 0;

        return;
    }

    if (c == '\r') {
        m_LPC24_Display_TextColumn = 0;

        return;
    }
    if (c == '\n') {
        m_LPC24_Display_TextColumn = 0;

        if (++m_LPC24_Display_TextRow >= LCD_MAX_ROW) {
            m_LPC24_Display_TextRow = LCD_MAX_ROW - 1;
            LPC24_Display_TextShiftColUp();
        }
        // clean the new line
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_LPC24_Display_TextBuffer[c][m_LPC24_Display_TextRow] = ' ';
        }

        return;
    }

    LPC24_Display_PrintChracter(m_LPC24_Display_TextColumn * 6, m_LPC24_Display_TextRow * 8, c);
    m_LPC24_Display_TextBuffer[m_LPC24_Display_TextColumn][m_LPC24_Display_TextRow] = c;

    if (++m_LPC24_Display_TextColumn >= (LCD_MAX_COLUMN - 1)) {
        m_LPC24_Display_TextColumn = 0;

        if (++m_LPC24_Display_TextRow >= LCD_MAX_ROW) {
            m_LPC24_Display_TextRow = LCD_MAX_ROW - 1;
            LPC24_Display_TextShiftColUp();
        }
        else {
            // clean the new line
            for (c = 0; c < LCD_MAX_COLUMN; c++) {
                m_LPC24_Display_TextBuffer[c][m_LPC24_Display_TextRow] = ' ';
            }
        }
    }
}
//=======================================================
void LPC24_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c) {
    volatile uint16_t * loc;

    if (m_LPC24_DisplayEnable == false)
        return;

    if (x >= m_LPC24_DisplayWidth)
        return;
    if (y >= m_LPC24_DisplayHeight)
        return;

    loc = m_LPC24_Display_VituralRam + (y *m_LPC24_DisplayWidth) + (x);

    if (c)
        *loc = 0x0fff;
    else
        *loc = 0;
}
//=======================================================
void LPC24_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p) {
    if (m_LPC24_DisplayEnable == false)
        return;

    for (int32_t i = 0; i < 8; i++) {
        if (p&(1 << i))
            LPC24_Display_PaintPixel(x, y + i, 1);
        else
            LPC24_Display_PaintPixel(x, y + i, 0);//clear
    }
}
//===========================================================
void LPC24_Display_TextEnterClearMode() {
    uint32_t r, c;

    if (m_LPC24_DisplayEnable == false)
        return;

    LPC24_Display_Clear();
    m_LPC24_Display_TextRow = 0;
    m_LPC24_Display_TextColumn = 0;

    for (r = 0; r < LCD_MAX_ROW; r++) {
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_LPC24_Display_TextBuffer[c][r] = '1';
        }
    }
}
//===========================================================
void LPC24_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c) {
    uint8_t i;

    if (m_LPC24_DisplayEnable == false)
        return;

    for (i = 0; i < 5; i++)
        LPC24_Display_Paint8HorizontalPixels(x + i, y, characters[c][i]);

    LPC24_Display_Paint8HorizontalPixels(x + i, y, 0);
}

void LPC24_Display_TextShiftColUp() {
    uint32_t r, c;

    if (m_LPC24_DisplayEnable == false)
        return;

    // refresh with new data
    LPC24_Display_Clear();
    m_LPC24_Display_TextRow = 0;
    m_LPC24_Display_TextColumn = 0;

    for (r = 0; r < (LCD_MAX_ROW - 1); r++) {
        for (c = 0; c < LCD_MAX_COLUMN - 1; c++) {
            m_LPC24_Display_TextBuffer[c][r] = m_LPC24_Display_TextBuffer[c][r + 1];
            LPC24_Display_WriteFormattedChar(m_LPC24_Display_TextBuffer[c][r]);
        }
    }
}

void LPC24_Display_Clear() {
    if (m_LPC24_DisplayEnable == false || m_LPC24_Display_VituralRam == nullptr)
        return;

    memset((uint32_t*)m_LPC24_Display_VituralRam, 0, m_LPC24_DisplayBufferSize);
}

const LPC24_Gpio_Pin g_Display_ControllerPins[] = LPC24_DISPLAY_CONTROLLER_PINS;
const LPC24_Gpio_Pin g_Display_BacklightPin = LPC24_DISPLAY_BACKLIGHT_PIN;
const LPC24_Gpio_Pin g_Display_EnablePin = LPC24_DISPLAY_ENABLE_PIN;

bool  LPC24_Display_SetPinConfiguration(bool enable) {
    if (enable) {
        LPC24XX::PCB().PINSEL11 = (5 << 1) | 1;
        LPC24XX::PCB().PINSEL10 = 0;

        for (auto i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
            if (!LPC24_Gpio_OpenPin(g_Display_ControllerPins[i].number)) {
                return false;
            }

            LPC24_Gpio_ConfigurePin(g_Display_ControllerPins[i].number, LPC24_Gpio_Direction::Input, g_Display_ControllerPins[i].pinFunction, LPC24_Gpio_PinMode::Inactive);
        }

        if (g_Display_EnablePin.number != PIN_NONE) {
            if (!LPC24_Gpio_OpenPin(g_Display_EnablePin.number)) {
                return false;
            }
        }

