ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_Display.cpp
        if (g_Display_BacklightPin.number != PIN_NONE) {
            if (!LPC24_Gpio_OpenPin(g_Display_BacklightPin.number)) {
                return false;

            }

            LPC24_Gpio_EnableOutputPin(g_Display_BacklightPin.number, true);
        }
    }
    else {
        for (int32_t i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
            LPC24_Gpio_ClosePin(g_Display_ControllerPins[i].number);
        }

        LPC24_Gpio_ClosePin(g_Display_EnablePin.number);

        LPC24_Gpio_ClosePin(g_Display_BacklightPin.number);
    }

    return true;
}
uint32_t* LPC24_Display_GetFrameBuffer() {
    return (uint32_t*)m_LPC24_Display_VituralRam;
}

int32_t LPC24_Display_GetWidth() {
    int32_t width = m_LPC24_DisplayWidth;
    int32_t height = m_LPC24_DisplayHeight;

    LPC24_Display_GetRotatedDimensions(&width, &height);

    return width;
}

int32_t LPC24_Display_GetHeight() {
    int32_t width = m_LPC24_DisplayWidth;
    int32_t height = m_LPC24_DisplayHeight;

    LPC24_Display_GetRotatedDimensions(&width, &height);

    return height;
}

uint32_t LPC24_Display_GetPixelClockDivider() {
    return m_LPC24_DisplayPixelClockRateKHz;
}

int32_t LPC24_Display_GetOrientation() {
    return m_LPC24_Display_CurrentRotation;
}

void  LPC24_Display_MemCopy(void *dest, void *src, int32_t size) {
    const int32_t MEMCOPY_BYTES_ALIGNED = 8;

    uint64_t *from64 = (uint64_t *)src;
    uint64_t *to64 = (uint64_t *)dest;

    int32_t block = size / MEMCOPY_BYTES_ALIGNED;
    int32_t remainder = size % MEMCOPY_BYTES_ALIGNED;

    while (block > 0) {
        *to64++ = *from64++;
        block--;
    }

    if (remainder > 0) {
        uint8_t *from8 = (uint8_t *)from64;
        uint8_t *to8 = (uint8_t *)to64;

        while (remainder > 0) {
            *to8++ = *from8++;

            remainder--;
        }
    }
}

void LPC24_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]) {

    int32_t xTo, yTo, xFrom, yFrom;
    int32_t xOffset = x;
    int32_t yOffset = y;
    uint16_t *from = (uint16_t *)data;
    uint16_t *to = (uint16_t *)m_LPC24_Display_VituralRam;


    int32_t screenWidth = m_LPC24_DisplayWidth;
    int32_t screenHeight = m_LPC24_DisplayHeight;
    int32_t startPx, toAddition;

    if (m_LPC24_DisplayEnable == false)
        return;

    switch (m_LPC24_Display_CurrentRotation) {
    case LPC24xx_LCD_Rotation::rotateNormal_0:

        if (xOffset == 0 && yOffset == 0 &&
            width == screenWidth && height == screenHeight) {
            LPC24_Display_MemCopy(to, from, (screenWidth*screenHeight * 2));
        }
        else {
            for (yTo = yOffset; yTo < (yOffset + height); yTo++) {
                LPC24_Display_MemCopy((void*)(to + yTo * screenWidth + xOffset), (void*)(from + yTo * screenWidth + xOffset), (width * 2));
            }
        }

        break;

    case LPC24xx_LCD_Rotation::rotateCCW_90:

        startPx = yOffset * screenHeight;
        xFrom = xOffset + width;
        yTo = screenHeight - xOffset - width;
        xTo = yOffset;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - height;

        for (; yTo < (screenHeight - xOffset); yTo++) {
            xFrom--;
            yFrom = startPx + xFrom;

            for (xTo = yOffset; xTo < (yOffset + height); xTo++) {
                *to++ = from[yFrom];
                yFrom += screenHeight;
            }

            to += toAddition;
        }

        break;

    case LPC24xx_LCD_Rotation::rotateCW_90:

        startPx = (yOffset + height - 1) * screenHeight;
        xFrom = xOffset;

        yTo = xOffset;
        xTo = screenWidth - yOffset - height;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - height;

        for (; yTo < (xOffset + width); yTo++) {
            yFrom = startPx + xFrom;

            for (xTo = screenWidth - yOffset - height; xTo < (screenWidth - yOffset); xTo++) {
                *to++ = from[yFrom];
                yFrom -= screenHeight;
            }

            to += toAddition;
            xFrom++;
        }

        break;

    case LPC24xx_LCD_Rotation::rotate_180:

        xFrom = (yOffset + height - 1) * screenWidth + xOffset + width;

        yTo = screenHeight - yOffset - height;
        xTo = screenWidth - xOffset - width;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - width;

        for (; yTo < (screenHeight - yOffset); yTo++) {

            for (xTo = screenWidth - xOffset - width; xTo < (screenWidth - xOffset); xTo++) {
                xFrom--;
                *to++ = from[xFrom];
            }

            to += toAddition;
            xFrom -= toAddition;
        }

        break;
    }

}

void LPC24_Display_WriteChar(uint8_t c, int32_t row, int32_t col) {
    m_LPC24_Display_TextRow = row;
    m_LPC24_Display_TextColumn = col;
    LPC24_Display_WriteFormattedChar(c);

}
void LPC24_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight) {
    switch (m_LPC24_Display_CurrentRotation) {
    case LPC24xx_LCD_Rotation::rotateNormal_0:
    case LPC24xx_LCD_Rotation::rotate_180:
        *screenWidth = m_LPC24_DisplayWidth;
        *screenHeight = m_LPC24_DisplayHeight;
        break;

    case LPC24xx_LCD_Rotation::rotateCCW_90:
    case LPC24xx_LCD_Rotation::rotateCW_90:
        *screenWidth = m_LPC24_DisplayHeight;
        *screenHeight = m_LPC24_DisplayWidth;
        break;
    }
}

TinyCLR_Result LPC24_Display_Acquire(const TinyCLR_Display_Controller* self) {
    m_LPC24_Display_CurrentRotation = LPC24xx_LCD_Rotation::rotateNormal_0;

    if (!LPC24_Display_SetPinConfiguration(true)) {
        return TinyCLR_Result::SharingViolation;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Display_Release(const TinyCLR_Display_Controller* self) {
    LPC24_Display_Uninitialize();

    LPC24_Display_SetPinConfiguration(false);

    m_LPC24_DisplayEnable = false;

    if (m_LPC24_Display_VituralRam != nullptr) {
        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        memoryProvider->Free(memoryProvider, m_LPC24_Display_VituralRam);

        m_LPC24_Display_VituralRam = nullptr;
    }

