ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_Display.cpp
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Display_Enable(const TinyCLR_Display_Controller* self) {
    if (m_LPC24_DisplayEnable || LPC24_Display_Initialize()) {
        m_LPC24_DisplayEnable = true;

        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result LPC24_Display_Disable(const TinyCLR_Display_Controller* self) {
    LPC24_Display_Uninitialize();

    m_LPC24_DisplayEnable = false;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Display_SetConfiguration(const TinyCLR_Display_Controller* self, TinyCLR_Display_DataFormat dataFormat, uint32_t width, uint32_t height, const void* configuration) {
    if (dataFormat != TinyCLR_Display_DataFormat::Rgb565) return TinyCLR_Result::NotSupported;

    if (configuration != nullptr) {
        auto& cfg = *(const TinyCLR_Display_ParallelConfiguration*)configuration;

        m_LPC24_DisplayWidth = width;
        m_LPC24_DisplayHeight = height;

        m_LPC24_DisplayOutputEnableIsFixed = cfg.DataEnableIsFixed;
        m_LPC24_DisplayOutputEnablePolarity = cfg.DataEnablePolarity;
        m_LPC24_DisplayPixelPolarity = cfg.PixelPolarity;

        m_LPC24_DisplayPixelClockRateKHz = cfg.PixelClockRate / 1000;

        m_LPC24_DisplayHorizontalSyncPolarity = cfg.HorizontalSyncPolarity;

        m_LPC24_DisplayHorizontalSyncPulseWidth = cfg.HorizontalSyncPulseWidth;
        m_LPC24_DisplayHorizontalFrontPorch = cfg.HorizontalFrontPorch;
        m_LPC24_DisplayHorizontalBackPorch = cfg.HorizontalBackPorch;

        m_LPC24_DisplayVerticalSyncPolarity = cfg.VerticalSyncPolarity;

        m_LPC24_DisplayVerticalSyncPulseWidth = cfg.VerticalSyncPulseWidth;
        m_LPC24_DisplayVerticalFrontPorch = cfg.VerticalFrontPorch;
        m_LPC24_DisplayVerticalBackPorch = cfg.VerticalBackPorch;

        switch (dataFormat) {
        case TinyCLR_Display_DataFormat::Rgb565:
            m_LPC24_DisplayBufferSize = width * height * 2;
            break;

        default:
            // TODO 8 - 24 - 32 bits
            break;
        }

        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        if (m_LPC24_Display_VituralRam != nullptr) {
            memoryProvider->Free(memoryProvider, m_LPC24_Display_VituralRam);

            m_LPC24_Display_VituralRam = nullptr;
        }

        m_LPC24_Display_VituralRam = (uint16_t*)((uint8_t*)memoryProvider->Allocate(memoryProvider, m_LPC24_DisplayBufferSize));

        if (m_LPC24_Display_VituralRam == nullptr) {
            return TinyCLR_Result::OutOfMemory;
        }

        if (g_Display_EnablePin.number != PIN_NONE) {
            if (m_LPC24_DisplayOutputEnableIsFixed)
                LPC24_Gpio_EnableOutputPin(g_Display_EnablePin.number, m_LPC24_DisplayOutputEnablePolarity);
            else
                LPC24_Gpio_ConfigurePin(g_Display_EnablePin.number, LPC24_Gpio_Direction::Input, LPC24_Gpio_PinFunction::PinFunction3, LPC24_Gpio_PinMode::Inactive);
        }
    }

    return  TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Display_GetConfiguration(const TinyCLR_Display_Controller* self, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) {
    dataFormat = TinyCLR_Display_DataFormat::Rgb565;
    width = m_LPC24_DisplayWidth;
    height = m_LPC24_DisplayHeight;

    if (configuration != nullptr) {
        auto& cfg = *(TinyCLR_Display_ParallelConfiguration*)configuration;

        cfg.DataEnableIsFixed = m_LPC24_DisplayOutputEnableIsFixed;
        cfg.DataEnablePolarity = m_LPC24_DisplayOutputEnablePolarity;
        cfg.PixelPolarity = m_LPC24_DisplayPixelPolarity;

        cfg.PixelClockRate = m_LPC24_DisplayPixelClockRateKHz * 1000;

        cfg.HorizontalSyncPolarity = m_LPC24_DisplayHorizontalSyncPolarity;

        cfg.HorizontalSyncPulseWidth = m_LPC24_DisplayHorizontalSyncPulseWidth;
        cfg.HorizontalFrontPorch = m_LPC24_DisplayHorizontalFrontPorch;
        cfg.HorizontalBackPorch = m_LPC24_DisplayHorizontalBackPorch;

        cfg.VerticalSyncPolarity = m_LPC24_DisplayVerticalSyncPolarity;

        cfg.VerticalSyncPulseWidth = m_LPC24_DisplayVerticalSyncPulseWidth;
        cfg.VerticalFrontPorch = m_LPC24_DisplayVerticalFrontPorch;
        cfg.VerticalBackPorch = m_LPC24_DisplayVerticalBackPorch;

        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result LPC24_Display_DrawBuffer(const TinyCLR_Display_Controller* self, uint32_t x, uint32_t y, uint32_t width, uint32_t height, const uint8_t* data) {
    LPC24_Display_BitBltEx(x, y, width, height, (uint32_t*)data);
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Display_DrawPixel(const TinyCLR_Display_Controller* self, uint32_t x, uint32_t y, uint64_t color) {
    uint8_t R = (color >> 16) & 0xFF;
    uint8_t G = (color >> 8) & 0xFF;
    uint8_t B = (color) & 0xFF;

    uint16_t rgb565 = (R & 0xF8) << 11;
    rgb565 |= (G & 0xFC) << 5;
    rgb565 |= (B & 0xF8);

    volatile uint16_t * loc;

    if (m_LPC24_DisplayEnable == false)
        return TinyCLR_Result::InvalidOperation;

    if (x >= m_LPC24_DisplayWidth)
        return TinyCLR_Result::InvalidOperation;
    if (y >= m_LPC24_DisplayHeight)
        return TinyCLR_Result::InvalidOperation;

    loc = m_LPC24_Display_VituralRam + (y *m_LPC24_DisplayWidth) + (x);

    *loc = rgb565;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Display_DrawString(const TinyCLR_Display_Controller* self, const char* data, size_t length) {
    for (size_t i = 0; i < length; i++)
        LPC24_Display_WriteFormattedChar(data[i]);

    return TinyCLR_Result::Success;
}

TinyCLR_Display_DataFormat dataFormats[] = { TinyCLR_Display_DataFormat::Rgb565 };

TinyCLR_Result LPC24_Display_GetCapabilities(const TinyCLR_Display_Controller* self, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {
    type = TinyCLR_Display_InterfaceType::Parallel;
    supportedDataFormatCount = SIZEOF_ARRAY(dataFormats);
    supportedDataFormats = dataFormats;

