ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_Display.cpp
    return TinyCLR_Result::Success;
}

const char* displayApiNames[TOTAL_DISPLAY_CONTROLLERS] = {
    "GHIElectronics.TinyCLR.NativeApis.LPC24.DisplayController\\0"
};

void LPC24_Display_AddApi(const TinyCLR_Api_Manager* apiManager) {
    for (auto i = 0; i < TOTAL_DISPLAY_CONTROLLERS; i++) {
        displayControllers[i].ApiInfo = &displayApi[i];
        displayControllers[i].Acquire = &LPC24_Display_Acquire;
        displayControllers[i].Release = &LPC24_Display_Release;
        displayControllers[i].Enable = &LPC24_Display_Enable;
        displayControllers[i].Disable = &LPC24_Display_Disable;
        displayControllers[i].SetConfiguration = &LPC24_Display_SetConfiguration;
        displayControllers[i].GetConfiguration = &LPC24_Display_GetConfiguration;
        displayControllers[i].GetCapabilities = &LPC24_Display_GetCapabilities;
        displayControllers[i].DrawBuffer = &LPC24_Display_DrawBuffer;
        displayControllers[i].DrawPixel = &LPC24_Display_DrawPixel;
        displayControllers[i].DrawString = &LPC24_Display_DrawString;

        displayApi[i].Author = "GHI Electronics, LLC";
        displayApi[i].Name = displayApiNames[i];
        displayApi[i].Type = TinyCLR_Api_Type::DisplayController;
        displayApi[i].Version = 0;
        displayApi[i].Implementation = &displayControllers[i];
        displayApi[i].State = nullptr;

        apiManager->Add(apiManager, &displayApi[i]);
    }

    m_LPC24_Display_VituralRam = nullptr;

    apiManager->SetDefaultName(apiManager, TinyCLR_Api_Type::DisplayController, displayApi[0].Name);
}

void LPC24_Display_Reset() {
    LPC24_Display_Clear();

    if (m_LPC24_DisplayEnable)
        LPC24_Display_Release(&displayControllers[0]);

    m_LPC24_DisplayEnable = false;
}
#endif
